# Быстрое решение проблем

## 🔍 Проблема 1: Вместо 80 постов создано 75 - как найти недостающие?

### Решение

1. Запустите скрипт анализа:
```bash
python find_missing_posts.py
```

2. Введите параметры:
   - Сколько постов ожидалось: `80`
   - За какой период смотреть: `168` (7 дней)

3. Скрипт покажет:
   - Сколько реально создано постов
   - Какие посты пропущены
   - Рекомендации по исправлению

### Что делать дальше?

#### Вариант А: Создать недостающие посты заново
1. В боте выберите "📹 100 постов стримеров"
2. Введите исходный канал
3. Укажите количество: `5` (или сколько пропущено)
4. Выберите направление (от последнего созданного поста)

#### Вариант Б: Проверить исходный канал
1. Откройте исходный канал с видео
2. Посмотрите последние видео которые не были использованы
3. Проверьте подписи - возможно там отсутствуют нужные данные
4. Добавьте данные вручную если нужно

## ⚠️ Проблема 2: Ошибка проверки JSON в Gemini 2.0 Flash

```
⚠️ Ошибка проверки:
Ошибка парсинга JSON: Unterminated string starting at: line 232 column 7 (char 5262). 
AI вернул невалидный JSON.
```

### Решение

✅ **УЖЕ ИСПРАВЛЕНО!** Обновлен файл `src/ai_post_generator.py`

Изменения:
- Увеличен лимит токенов с 2000 до 4000
- Добавлена автоматическая фиксация оборванных JSON
- Улучшено логирование ошибок

### Что делать сейчас?

1. **Перезапустите бота:**
```bash
# Остановите текущий процесс (Ctrl+C)
python bot.py
```

2. **Попробуйте проверку снова:**
   - Выберите "📹 100 постов стримеров"
   - Сгенерируйте посты
   - При проверке уникальности выберите:
     - ⚡ **Быстрая** (Gemini Flash) - теперь работает стабильно
     - 🔄 **Гибридная** - если хотите максимальную надежность

### Если ошибка всё равно возникает

Используйте альтернативную модель:
- 👍 **Хорошая** (GPT-4o Mini) - ~0.05₽
- ⭐ **Отличная** (Gemini 3 Pro) - ~2₽

## 📊 Проверка текущего состояния базы

### Сколько постов в базе?

```bash
python -c "import json; data = json.load(open('data/my_posts.json', 'r', encoding='utf-8')); print(f'Всего постов: {len(data[\"posts\"])}')"
```

### Последние посты по датам

```bash
python -c "import json; data = json.load(open('data/my_posts.json', 'r', encoding='utf-8')); posts = data['posts'][-100:]; dates = {}; [dates.setdefault(p['date'][:10], []).append(p) for p in posts]; [print(f'{date}: {len(ps)} постов') for date, ps in sorted(dates.items(), reverse=True)[:10]]"
```

## 🚀 Рекомендации

### Для стабильной работы

1. **После каждой большой сессии генерации**:
   - Запускайте `find_missing_posts.py`
   - Проверяйте количество созданных постов
   - Смотрите логи на наличие ошибок

2. **Выбор модели проверки уникальности**:
   - Для 20-50 постов: ⚡ Быстрая (Gemini Flash)
   - Для 80-100 постов: 🔄 Гибридная (Flash + Pro)
   - Для критически важных постов: ⭐ Отличная (Gemini 3 Pro)

3. **Мониторинг ошибок**:
   - Включите логирование в боте
   - Проверяйте `bot.log` после каждой сессии
   - При повторяющихся ошибках - смените модель AI

### Если пропускаются посты регулярно

Возможные причины:
1. **Нет данных в подписи видео** - добавьте вручную
2. **Видео без подписи** - используйте ручной ввод данных
3. **Лимиты Telegram** - увеличьте паузы между генерацией
4. **Ошибки API** - проверьте ключи API (OpenRouter, Google)

## 📞 Поддержка

Если проблемы продолжаются:
1. Соберите логи: скопируйте последние 50 строк из `bot.log`
2. Запустите `find_missing_posts.py` и сохраните вывод
3. Сделайте скриншот ошибки в боте
4. Свяжитесь с разработчиком

## ✅ Чеклист после исправлений

- [x] Обновлен `src/ai_post_generator.py`
- [x] Создан `find_missing_posts.py`
- [ ] Перезапущен бот
- [ ] Проверена генерация постов
- [ ] Проверена проверка уникальности
- [ ] Запущен анализ пропущенных постов
